"use client";

import React from "react";

const Policy = () => {
  return (
    <>

    <div className="mt-24 min-h-[70vh] p-4">
    <h1 className="text-center font-semibold text-2xl">隱私權保護聲明</h1>
    <hr />
    <br />

    <p>品誠線上以最嚴謹的方式保障您線上的隱私，請您詳細閱讀本聲明，您絕對可以瞭解到在您使用誠品線上所提供的多項服務時，
       我們處理您個人資料的政策與原則，以及蒐集利用之範圍及目的。本聲明隨時可能會變更，請定期查詢。本公司將依法令及本聲明
       內容保護您對您個人資料之隱私權。
    </p>
    <br />

    <h2 className="font-semibold text-xl">一、品誠線上所蒐集的個人資料？</h2>
    <p>品誠線上以多種方式從網站的不同部分蒐集個人資料，敬請詳細閱讀以下說明。若您不願提供個人資料或不同意本聲明，請立即停止使用品誠線上提供之服務。
       若您提供個人資料予品誠線上，則視為您同意本聲明。
    </p>
    <br />

    <h2 className="font-semibold text-xl">二、品誠線上對所蒐集之個人資料的利用？</h2>
    <p>為了您可以在品誠線上上得到完善的多樣化服務，我們希望透過蒐集、分析您使用各項服務之頻率、輸入之個人資料、意願調查結果等資料，
       了解您的使用習慣，以便為您提供更個人化的服務，並作為我們改進服務之重要參考指標。</p>
    <p>特別注意事項：基於達成前述目的之必要範圍內，本公司得與本公司之關係企業分享品誠線上使用者之個人資料。</p>
    </div>

    </>
  );
};

export default Policy;